# Задание
# Input: lst = [2, 3, 4, 1, 5]
# 2 => 4: [4, 3, 4, 1, 5]
# 3 => 9: [4, 9, 4, 1, 5]
# 4 => 16: [4, 9, 16, 1, 5]
# 1 => 1: [4, 9, 16, 1, 5]
# 5 => 25: [4, 9, 16, 1, 25]
# Output: result = [4, 9, 16, 1, 25]
lst = [2, 3, 4, 1, 5]  # N
pow = 2
# lst[0] = lst[0] ** 2
# lst[1] = lst[1] ** 2
# lst[2] = lst[2] ** 2
# lst[3] = lst[3] ** 2
# lst[4] = lst[4] ** 2
i = 0
while i < len(lst):  # O(N)
    lst[i] **= pow  # O(1)
    i += 1  # O(1)
# O(N) * (O(1) + O(1)) => O(N) * 2 => O(N)
# Сложность по доп. памяти: O(1)
print(lst)

result = [x ** pow for x in lst]  # O(N)
# Сложность по доп. памяти: O(N)
print(result)
